Autodesk.Revit.DB.Electrical.ConduitSizes.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.Electrical.ConduitSizes.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.Electrical.ConduitSizes.GetConduitSizesIterator
Returns a ConduitSizeIterator to the conduit sizes.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizes.Contains(System.Double)
Checks whether a conduit size with the nominal diameter exists.
nominalDiameter:
Nominal diameter.
Returns:
True if a conduit size with the nominal diameter exists.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for nominalDiameter must be greater than 0 and no more than 30000 feet.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizes.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Electrical.ConduitSizes.Count
Count of the items contained in the collection.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSizes
Class ConduitSizeSet being used to store the conduit sizes.
Since:
2017